[DataFrame에서 원소 추출]<hr>

In [20]:
## [1-1] 모듈로딩
import pandas as pd
import numpy as np

In [21]:
# [1-2] 데이터준비
dataFile = '../DATA/member.csv'

[2] 데이터 로딩 및 확인 <hr>

In [22]:
##[2-1] 데이터 로딩
memDF =pd.read_csv(dataFile)

In [24]:
##[2-2] 데이터 확인
memDF.info()
print(memDF.head(),'\n',memDF.tail())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      7 non-null      int64
 1   이름      7 non-null      object
 2   나이      7 non-null      int64
 3   지역      7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes
   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
    번호   이름  나이  지역
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
5   6  김나나  25  서울
6   7  박서희  33  광주

In [28]:
memDF.describe(include=[object])

         이름  지역
count     7   7
unique    7   5
top     홍길동  대구
freq      1   2

In [32]:
memDF.describe(exclude=[object])

             번호         나이
count  7.000000   7.000000
mean   4.000000  22.857143
std    2.160247   7.470577
min    1.000000  12.000000
25%    2.500000  18.500000
50%    4.000000  22.000000
75%    5.500000  28.000000
max    7.000000  33.000000

[3] 원소 선택 <hr>

In [34]:
## - 원소선택 : DF.loc[행인덱스, 열인덱스]
# 각 자리에 리스트, 슬라이싱 가능
memDF

   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
5   6  김나나  25  서울
6   7  박서희  33  광주

In [43]:
memDF.loc[3,'이름'], memDF.iloc[3,1]

('마징가', '마징가')

In [44]:
memDF.loc[[1,3],'지역'], memDF.iloc[[1,3], 3]

(1    서울
 3    부산
 Name: 지역, dtype: object,
 1    서울
 3    부산
 Name: 지역, dtype: object)

In [46]:
memDF.loc[[1,3],['지역', '나이']], memDF.iloc[[1,3], [3,2]]

(   지역  나이
 1  서울  12
 3  부산  31,
    지역  나이
 1  서울  12
 3  부산  31)

In [53]:
memDF.loc[0:3, '번호': '이름'], memDF.iloc[0:3, 0:2]

(   번호   이름
 0   1  홍길동
 1   2  이나영
 2   3  최희진
 3   4  마징가,
    번호   이름
 0   1  홍길동
 1   2  이나영
 2   3  최희진)

In [60]:
memCoDF = memDF.copy()
memCoDF.index = [f"{i}번째" for i in memCoDF.index]
memCoDF

     번호   이름  나이  지역
0번째   1  홍길동  20  대구
1번째   2  이나영  12  서울
2번째   3  최희진  22  마산
3번째   4  마징가  31  부산
4번째   5  박지민  17  대구
5번째   6  김나나  25  서울
6번째   7  박서희  33  광주

In [61]:
memCoDF.loc['1번째'::2, :], memCoDF.iloc[1::2,:]

(     번호   이름  나이  지역
 1번째   2  이나영  12  서울
 3번째   4  마징가  31  부산
 5번째   6  김나나  25  서울,
      번호   이름  나이  지역
 1번째   2  이나영  12  서울
 3번째   4  마징가  31  부산
 5번째   6  김나나  25  서울)

In [65]:
# 홍길동 최희진 박지민 박지희  이름과 나이
memDF.loc[2::2,['이름','나이']], memDF.iloc[2::2,[1,2]]

(    이름  나이
 2  최희진  22
 4  박지민  17
 6  박서희  33,
     이름  나이
 2  최희진  22
 4  박지민  17
 6  박서희  33)

In [77]:
#하드코딩방지
memDF.loc[memDF.index[2],memDF.columns[1]] , memDF.iloc[memDF.index[2], 1]
                                                        # memDF.index[2]가 정수라서 가능

('최희진', '최희진')

In [79]:
# memCoDF.iloc[memCoDF.index[2], 1]
#             memCoDF.index[2] 정수가 아니라서 불가능
memCoDF.iloc[2, 1]

'최희진'